scripts/tests/vegeta/report.txt
Requests      [total, rate, throughput]         1500, 50.01, 0.00
Duration      [total, attack, wait]             51.022s, 29.993s, 21.029s
Latencies     [min, mean, 50, 90, 95, 99, max]  21.003s, 21.036s, 21.035s, 21.052s, 21.06s, 21.083s, 21.112s
Bytes In      [total, mean]                     0, 0.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           0.00%
Status Codes  [code:count]                      0:1500  
Error Set:
Get "http://103.54.153.248:3001/api/health": dial tcp 0.0.0.0:0->103.54.153.248:3001: connectex: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get "http://103.54.153.248:3001/api/courses": dial tcp 0.0.0.0:0->103.54.153.248:3001: connectex: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.
Get "http://103.54.153.248:3001/api/auth/profile": dial tcp 0.0.0.0:0->103.54.153.248:3001: connectex: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond.